app/views/favorites/_favorite.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
---
  <%= link_to book_favorites_path(book), method: :delete, remote: true, class: "text-danger" do %>
    <i class="fas fa-heart"></i><%= book.favorites.count %>

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
---
  <%= link_to book_favorites_path(book), method: :post, remote: true do %>
    <i class="fas fa-heart"></i><%= book.favorites.count %>