app/views/books/show.html.erb

                <%= link_to book_favorites_path(@show_book), method: :delete, class: "text-danger" do %>
                  <i class="fas fa-heart"></i><%= @show_book.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]

                <%= link_to book_favorites_path(@show_book), method: :post do %>
                  <i class="fas fa-heart"></i><%= @show_book.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]

            <% end %>
            <td>コメント件数：<%= @show_book.book_comments.count %></td>
---
SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]

      <div class="comments mb-5">
        <% @show_book.book_comments.each do |book_comment| %>
---
SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]