app/controllers/book_comments_controller.rb

  def create
    @show_book = Book.find(params[:book_id])
    @comment = current_user.book_comments.new(book_comment_params)
    @comment.book_id = @show_book.id
    if @comment.save
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "book_comments" ("comment", "user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "test comment"], ["user_id", 1], ["book_id", 1], ["created_at", "2021-10-23 06:40:13.010306"], ["updated_at", "2021-10-23 06:40:13.010306"]]

  def destroy
    @comment = BookComment.find_by(id: params[:id], book_id: params[:book_id])
    @show_book = @comment.book
    @comment.destroy
---
SELECT  "book_comments".* FROM "book_comments" WHERE "book_comments"."id" = ? AND "book_comments"."book_id" = ? LIMIT ?  [["id", 3], ["book_id", 1], ["LIMIT", 1]]
DELETE FROM "book_comments" WHERE "book_comments"."id" = ?  [["id", 1]]