app/controllers/relationships_controller.rb

  def create
    follow = current_user.active_relationships.build(followed_id: params[:user_id])
    follow.save
---
INSERT INTO "relationships" ("follower_id", "followed_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["follower_id", 2], ["followed_id", 1], ["created_at", "2021-11-01 09:42:59.447184"], ["updated_at", "2021-11-01 09:42:59.447184"]]

  def destroy
    follow = current_user.active_relationships.find_by(followed_id: params[:user_id])
    follow.destroy
---
DELETE FROM "relationships" WHERE "relationships"."id" = ?  [["id", 1]]