app/controllers/searches_controller.rb

SELECT "books".* FROM "books" WHERE (title LIKE'%test%')
SELECT "users".* FROM "users" WHERE (name LIKE 'test')
---
  def search
    @model = params[:model]
    @method = params[:method]
    if @model == "book"
      @books = Book.search(params[:search])
    else
      @users = User.search(params[:search])